Revit 2027 API
ExternalDataManagerTool.GetChildCommandIds Method
 Obtains the sub menu of the item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExternalDataManagerCommandId> GetChildCommandIds()
Public Function GetChildCommandIds As IList(Of ExternalDataManagerCommandId)
public:
IList<ExternalDataManagerCommandId^>^ GetChildCommandIds()
member GetChildCommandIds : unit -> IList<ExternalDataManagerCommandId>
Return Value
IList<ExternalDataManagerCommandId>
 The array of child command ids or an empty array when none have been set.
See Also
Reference
ExternalDataManagerTool Class
Autodesk.Revit.UI Namespace